# Используем официальный Python-образ как базовый
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями, если он есть
# (хотя в нашем случае можно пропустить этот шаг,
# так как у нас только одна зависимость)

# Копируем наш Python-скрипт и файл с данными в контейнер
COPY translate_values.py .
COPY input.json .

# Устанавливаем необходимую библиотеку
RUN pip install google-generativeai

# Эта команда будет выполняться при запуске контейнера
# Она запускает наш Python-скрипт
CMD ["python", "translate_values.py"]